/* Main window strings */
"IMAGE_INFO_LINE"			= "Palette: %@, Size: %d x %d, Seed: %d";
"INFO_PALETTE_FIND"			= "Palette: ";
"INFO_SIZE_FIND"			= "Size: ";
"INFO_SIZE_FIND2"			= " x ";
"INFO_SEED_FIND"			= "Seed: ";
"FILENAME_PREFIX"			= "/Starfish-%d-%@-(%dx%d)";
"AUTOSTART_TEXT"			= "New pattern at %@.";
"AUTOSTART_ITEM"			= "New pattern at %@";
"NUM_RECENT_PATT_TEXT"		= "(You have %d recent patterns.)";
"ASK_VERS_CHECK_MSG"		= "StarfishX can check its website to see if a newer version is available. (Please see the Read Me file for all the details.) Would you like StarfishX to automatically check for a newer version when it starts up?";
"CHECK_VERS_DATES"			= "\n\nLast checked %@\nNext check no sooner than: %@";
"CHECKING_VERS_TEXT"		= "Checking…";
"CHECK_VERS_FAILED_TEXT"	= "Check failed: %@";
"NEW_VERS_TITLE"			= "New Version!";
"CV_FOUND_NEW_MSG"			= "A newer version (%@) of StarfishX is now available!";
"CV_FOUND_NEW_TEXT"			= "New version %@ available!";
"CV_CURRENT_VERS_TEXT"		= "You have the most recent version of StarfishX.";
"QUIT_WHILE_GEN_MSG"		= "A pattern is currently being generated. Are you sure you want to quit?";
"TRASH_PATTS_MSG"			= "The %d oldest pattern files will be moved to the Trash immediately. Do you wish to proceed?";
"TRASH_PATT_MSG"			= "The oldest pattern file will be moved to the Trash immediately. Do you wish to proceed?";
"CONT_PATTERN_TEXT"			= "<Continuous Pattern Creation>";
"CANT_RUN_G3"				= "This version of StarfishX requires a G4 or higher processor and can not run on this computer.";
"GET_G4_VERSION"			= "This version of StarfishX is not optimized to run on a G4 or higher computer. You should download the Altivec version of StarfishX.";

/* Custom Size Dialog strings */
"HUGE_IMAGE" 				= "This image will require %.2fMB of RAM to create.";
"ALTIVEC_ROUNDED_SIZE"		= "When using Altivec, the width will be rounded down to a multiple of %d pixels (i.e., %d pixels).";

/* Edit Palettes Dialog strings */
"COLORS_TABLE_HEADER"		= "Colors for “%@”:";
"UNTITLED_PALETTE"			= "untitled palette";

/* Preferences Dialog strings */
"PRIO_CHANGE_MSG"			= "This change will take effect the next time you launch StarfishX";

/* Menu items */
"CLOSE_MAIN_WINDOW_ITEM"	= "Close StarfishX window";
"OPEN_MAIN_WINDOW_ITEM"		= "Open StarfishX window";
"NEW_PATTERN_ITEM"			= "Create New Pattern";
"CANCEL_PATTERN_ITEM"		= "Stop Pattern Creation";
"NEW_PATTERN_UNTIL_ITEM"	= "Create Until Recent Cache Full";
"SKIP_PATTERN_ITEM"			= "Skip Current Pattern";
"MAIN_DISPLAY_ITEM"			= "Main Display";
"DISPLAY_NUM_ITEM"			= "Display %d";
"CUSTOM_SIZE_ITEM"			= "Custom (%d x %d)…";
"SHOW_SETTINGS_DRAWER"		= "Show Pattern Settings";
"HIDE_SETTINGS_DRAWER"		= "Hide Pattern Settings";
"SHOW_RECENT_DRAWER"		= "Show Recent Patterns";
"HIDE_RECENT_DRAWER"		= "Hide Recent Patterns";

/* Buttons */
"OK_BUTTON"					= "OK";
"DONE_BUTTON"				= "Done";
"QUIT_BUTTON"				= "Quit";
"CONTINUE_BUTTON"			= "Continue";
"CANCEL_BUTTON"				= "Cancel";
"YES_CHECK_BUTTON"			= "Yes, check";
"NO_DONT_CHECK_BUTTON"		= "No, don't check";
"CV_TAKE_ME_THERE"			= "Take me there!";
"YES_BUTTON"				= "Yes";
"NO_BUTTON"					= "No";
"INSTALL_ON_TITLE"			= "Install on";
"NEW_PATTERN_BUTTON"		= "New Pattern";
"CONTINUOUS_BUTTON"			= "Continuous";
"SKIP_BUTTON"				= "Skip Pattern";
"STOP_BUTTON"				= "Stop";

/* Default palette names */
"PALETTE_FULL_SPECTRUM"		= "full spectrum";
"PALETTE_BLUE"				= "Blue";
"PALETTE_GREY"				= "Grey";
"PALETTE_RAINBOW"			= "Rainbow";
"PALETTE_RED"				= "Red";
"PALETTE_SEASIDE"			= "Seaside";
"PALETTE_AUTUMN"			= "Autumn";
"PALETTE_WINTER"			= "Winter";
"PALETTE_SPRING"			= "Spring";
"PALETTE_SUMMER"			= "Summer";
"PALETTE_AQUA"				= "Aqua";
"PALETTE_USA"				= "USA";
"PALETTE_HALLOWEEN"			= "Halloween";
"PALETTE_CHRISTMAS"			= "Christmas";
"PALETTE_EASTER"			= "Easter";
"PALETTE_BRONCO"			= "Bronco";
"PALETTE_SKY"				= "Sky";
"PALETTE_SAVANNAH"			= "Savannah";
"PALETTE_STORM"				= "Storm";
"PALETTE_ATLANTIS"			= "Atlantis";
